<a href="https://colab.research.google.com/github/iam-fern/Research/blob/main/generate_datanew.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [29]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy.stats import norm
from numpy.random import normal
import statistics

In [30]:
# numpy.random.normal(loc=0.0, scale=1.0, size=None)
# generate sample of 200 values that follow a normal distribution 
# data = normal(loc=0, scale=1, size=200)

data = pd.DataFrame({"zt1" : normal(0, 1, 3000),
                     "zt2" : normal(0, 1, 3000),
                     "zt3" : normal(0, 1, 3000)})
data

           zt1       zt2       zt3
0     1.240355 -1.125888 -0.211730
1     0.765561 -2.238614 -0.159952
2    -1.222009  0.271034 -0.530323
3    -1.012719 -0.206749  0.968443
4    -0.446962 -1.968192 -0.833243
...        ...       ...       ...
2995  0.526485 -0.170080 -0.598048
2996  0.548980  0.092113 -0.344826
2997  1.881199 -0.446417  0.131779
2998  0.170025  1.923810 -0.167287
2999 -0.892123  0.268346 -0.769526

[3000 rows x 3 columns]

In [31]:
p = 0

In [32]:
Zt1 = data['zt1']
Zt2 = data['zt2']
Zt3 = data['zt3']

In [33]:
xt1 = (1-(p**2))**(1/2)*Zt1
xt2 = (1-(p**2))**(1/2)*Zt2
xt3 = (1-(p**2))**(1/2)*Zt3

In [34]:
xt1

0       1.240355
1       0.765561
2      -1.222009
3      -1.012719
4      -0.446962
          ...
2995    0.526485
2996    0.548980
2997    1.881199
2998    0.170025
2999   -0.892123
Name: zt1, Length: 3000, dtype: float64

In [35]:
new_data = pd.DataFrame({'Xt1' : data['zt1'],
                         'Xt2' : data['zt2'],
                         'Xt3' : data['zt3'],
                         'e'   : normal(0, xt2**4, 3000)})
new_data

           Xt1       Xt2       Xt3          e
0     1.240355 -1.125888 -0.211730  -1.310200
1     0.765561 -2.238614 -0.159952  18.513376
2    -1.222009  0.271034 -0.530323   0.001092
3    -1.012719 -0.206749  0.968443   0.000029
4    -0.446962 -1.968192 -0.833243  -8.684002
...        ...       ...       ...        ...
2995  0.526485 -0.170080 -0.598048   0.001485
2996  0.548980  0.092113 -0.344826   0.000049
2997  1.881199 -0.446417  0.131779   0.038214
2998  0.170025  1.923810 -0.167287  19.874585
2999 -0.892123  0.268346 -0.769526   0.001209

[3000 rows x 4 columns]

In [36]:
table_data = pd.DataFrame({'Xt1' : data['zt1'],
                           'Xt2' : data['zt2'],
                           'Xt3' : data['zt3'],
                           'e'   : new_data['e']})
table_data['Y'] = 4+0.4*table_data['Xt1']+1.5*table_data['Xt2']+3.6*table_data['Xt3']+table_data['e']
table_data

           Xt1       Xt2       Xt3          e          Y
0     1.240355 -1.125888 -0.211730  -1.310200   0.734882
1     0.765561 -2.238614 -0.159952  18.513376  18.885852
2    -1.222009  0.271034 -0.530323   0.001092   2.009678
3    -1.012719 -0.206749  0.968443   0.000029   6.771212
4    -0.446962 -1.968192 -0.833243  -8.684002 -10.814752
...        ...       ...       ...        ...        ...
2995  0.526485 -0.170080 -0.598048   0.001485   1.803987
2996  0.548980  0.092113 -0.344826   0.000049   3.116437
2997  1.881199 -0.446417  0.131779   0.038214   4.595473
2998  0.170025  1.923810 -0.167287  19.874585  26.226079
2999 -0.892123  0.268346 -0.769526   0.001209   1.276584

[3000 rows x 5 columns]

In [37]:
new_data.mean()

Xt1   -0.012958
Xt2    0.005247
Xt3    0.002778
e     -0.342848
dtype: float64

In [38]:
new_data.var()

Xt1      1.053188
Xt2      0.981343
Xt3      1.008116
e      160.359666
dtype: float64

In [39]:
# Compute pairwise correlation of columns, excluding NA/null values.

data.corr()

          zt1       zt2       zt3
zt1  1.000000 -0.002491  0.016606
zt2 -0.002491  1.000000 -0.001008
zt3  0.016606 -0.001008  1.000000